; domain
;; Adapted from: https://github.com/josej30/Planner-Sat-Constraints
;; We use existential preconditions (exists) to remove as many parameters from the actions as possible

(define (domain logistics)

(:requirements :strips :typing :existential-preconditions) 

(:types  city location thing - object
         package vehicle - thing
         truck airplane - vehicle  
         airport - location)
  
(:predicates  (in-city ?l - location ?c - city)
              (at ?obj - thing ?l - location)
              (in ?p - package ?veh - vehicle))
  
(:action drive
         :parameters    (?t - truck ?from ?to - location)
         :precondition  (and 
                             (at ?t ?from)
                             (exists (?c - city)
                                (and (in-city ?from ?c) (in-city ?to ?c))
                              )
                         )
         :effect        (and (not (at ?t ?from))
                             (at ?t ?to)))

(:action fly
         :parameters    (?a - airplane ?from ?to - airport)
         :precondition  (at ?a ?from)
         :effect        (and (not (at ?a ?from))
                             (at ?a ?to)))

(:action load
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (at ?p ?l))
         :effect        (and (not (at ?p ?l))
                             (in ?p ?v)))

(:action unload
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (in ?p ?v))
         :effect        (and (not (in ?p ?v))
                             (at ?p ?l)))

)

; problem
(define (problem problem_90)

(:domain logistics)

(:objects
	obj0 obj2 obj5 - airport
	obj1 obj3 obj6 - city
	obj4 obj7 obj8 - truck
	obj9 obj10 obj14 obj16 obj18 obj19 obj21 obj25 obj27 - package
	obj11 obj12 obj13 obj15 obj17 obj22 obj23 - location
	obj20 obj24 obj26 - airplane
)

(:init
	(at obj4 obj0)
	(at obj7 obj2)
	(at obj8 obj5)
	(at obj9 obj0)
	(at obj10 obj5)
	(at obj14 obj2)
	(at obj16 obj5)
	(at obj18 obj2)
	(at obj19 obj2)
	(at obj20 obj0)
	(at obj21 obj5)
	(at obj24 obj2)
	(at obj25 obj0)
	(at obj26 obj5)
	(at obj27 obj2)
	(in-city obj0 obj1)
	(in-city obj2 obj3)
	(in-city obj5 obj6)
	(in-city obj11 obj1)
	(in-city obj12 obj6)
	(in-city obj13 obj1)
	(in-city obj15 obj3)
	(in-city obj17 obj1)
	(in-city obj22 obj1)
	(in-city obj23 obj3)
)

(:goal (and
	(at obj9 obj12)
	(at obj10 obj23)
	(at obj14 obj17)
	(at obj16 obj15)
	(at obj18 obj11)
	(at obj19 obj12)
	(at obj21 obj23)
	(at obj25 obj15)
	(at obj27 obj12)
))
)

; plan
1. (drive obj4 obj0 obj13)
   deleted: (at obj4 obj0)
   added: (at obj4 obj13)
   goals met: 0 of 9
2. (drive obj7 obj2 obj15)
   deleted: (at obj7 obj2)
   added: (at obj7 obj15)
   goals met: 0 of 9
3. (load obj20 obj25 obj0)
   deleted: (at obj25 obj0)
   added: (in obj25 obj20)
   goals met: 0 of 9
4. (load obj20 obj9 obj0)
   deleted: (at obj9 obj0)
   added: (in obj9 obj20)
   goals met: 0 of 9
5. (load obj24 obj14 obj2)
   deleted: (at obj14 obj2)
   added: (in obj14 obj24)
   goals met: 0 of 9
6. (load obj24 obj18 obj2)
   deleted: (at obj18 obj2)
   added: (in obj18 obj24)
   goals met: 0 of 9
7. (load obj26 obj10 obj5)
   deleted: (at obj10 obj5)
   added: (in obj10 obj26)
   goals met: 0 of 9
8. (load obj26 obj16 obj5)
   deleted: (at obj16 obj5)
   added: (in obj16 obj26)
   goals met: 0 of 9
9. (load obj26 obj21 obj5)
   deleted: (at obj21 obj5)
   added: (in obj21 obj26)
   goals met: 0 of 9
10. (fly obj20 obj0 obj2)
   deleted: (at obj20 obj0)
   added: (at obj20 obj2)
   goals met: 0 of 9
11. (fly obj24 obj2 obj0)
   deleted: (at obj24 obj2)
   added: (at obj24 obj0)
   goals met: 0 of 9
12. (fly obj26 obj5 obj2)
   deleted: (at obj26 obj5)
   added: (at obj26 obj2)
   goals met: 0 of 9
13. (drive obj4 obj13 obj0)
   deleted: (at obj4 obj13)
   added: (at obj4 obj0)
   goals met: 0 of 9
14. (drive obj7 obj15 obj2)
   deleted: (at obj7 obj15)
   added: (at obj7 obj2)
   goals met: 0 of 9
15. (load obj20 obj19 obj2)
   deleted: (at obj19 obj2)
   added: (in obj19 obj20)
   goals met: 0 of 9
16. (load obj20 obj27 obj2)
   deleted: (at obj27 obj2)
   added: (in obj27 obj20)
   goals met: 0 of 9
17. (unload obj20 obj25 obj2)
   deleted: (in obj25 obj20)
   added: (at obj25 obj2)
   goals met: 0 of 9
18. (unload obj24 obj14 obj0)
   deleted: (in obj14 obj24)
   added: (at obj14 obj0)
   goals met: 0 of 9
19. (unload obj24 obj18 obj0)
   deleted: (in obj18 obj24)
   added: (at obj18 obj0)
   goals met: 0 of 9
20. (unload obj26 obj10 obj2)
   deleted: (in obj10 obj26)
   added: (at obj10 obj2)
   goals met: 0 of 9
21. (unload obj26 obj16 obj2)
   deleted: (in obj16 obj26)
   added: (at obj16 obj2)
   goals met: 0 of 9
22. (unload obj26 obj21 obj2)
   deleted: (in obj21 obj26)
   added: (at obj21 obj2)
   goals met: 0 of 9
23. (fly obj20 obj2 obj5)
   deleted: (at obj20 obj2)
   added: (at obj20 obj5)
   goals met: 0 of 9
24. (fly obj24 obj0 obj2)
   deleted: (at obj24 obj0)
   added: (at obj24 obj2)
   goals met: 0 of 9
25. (fly obj26 obj2 obj5)
   deleted: (at obj26 obj2)
   added: (at obj26 obj5)
   goals met: 0 of 9
26. (load obj4 obj14 obj0)
   deleted: (at obj14 obj0)
   added: (in obj14 obj4)
   goals met: 0 of 9
27. (load obj4 obj18 obj0)
   deleted: (at obj18 obj0)
   added: (in obj18 obj4)
   goals met: 0 of 9
28. (load obj7 obj10 obj2)
   deleted: (at obj10 obj2)
   added: (in obj10 obj7)
   goals met: 0 of 9
29. (load obj7 obj16 obj2)
   deleted: (at obj16 obj2)
   added: (in obj16 obj7)
   goals met: 0 of 9
30. (load obj7 obj21 obj2)
   deleted: (at obj21 obj2)
   added: (in obj21 obj7)
   goals met: 0 of 9
31. (load obj7 obj25 obj2)
   deleted: (at obj25 obj2)
   added: (in obj25 obj7)
   goals met: 0 of 9
32. (unload obj20 obj19 obj5)
   deleted: (in obj19 obj20)
   added: (at obj19 obj5)
   goals met: 0 of 9
33. (unload obj20 obj27 obj5)
   deleted: (in obj27 obj20)
   added: (at obj27 obj5)
   goals met: 0 of 9
34. (unload obj20 obj9 obj5)
   deleted: (in obj9 obj20)
   added: (at obj9 obj5)
   goals met: 0 of 9
35. (drive obj4 obj0 obj11)
   deleted: (at obj4 obj0)
   added: (at obj4 obj11)
   goals met: 0 of 9
36. (drive obj7 obj2 obj15)
   deleted: (at obj7 obj2)
   added: (at obj7 obj15)
   goals met: 0 of 9
37. (fly obj20 obj5 obj0)
   deleted: (at obj20 obj5)
   added: (at obj20 obj0)
   goals met: 0 of 9
38. (fly obj24 obj2 obj0)
   deleted: (at obj24 obj2)
   added: (at obj24 obj0)
   goals met: 0 of 9
39. (fly obj26 obj5 obj0)
   deleted: (at obj26 obj5)
   added: (at obj26 obj0)
   goals met: 0 of 9
40. (load obj8 obj19 obj5)
   deleted: (at obj19 obj5)
   added: (in obj19 obj8)
   goals met: 0 of 9
41. (load obj8 obj27 obj5)
   deleted: (at obj27 obj5)
   added: (in obj27 obj8)
   goals met: 0 of 9
42. (load obj8 obj9 obj5)
   deleted: (at obj9 obj5)
   added: (in obj9 obj8)
   goals met: 0 of 9
43. (unload obj4 obj18 obj11)
   deleted: (in obj18 obj4)
   added: (at obj18 obj11)
   goals met: 1 of 9
44. (unload obj7 obj16 obj15)
   deleted: (in obj16 obj7)
   added: (at obj16 obj15)
   goals met: 2 of 9
45. (unload obj7 obj25 obj15)
   deleted: (in obj25 obj7)
   added: (at obj25 obj15)
   goals met: 3 of 9
46. (drive obj4 obj11 obj17)
   deleted: (at obj4 obj11)
   added: (at obj4 obj17)
   goals met: 3 of 9
47. (drive obj7 obj15 obj23)
   deleted: (at obj7 obj15)
   added: (at obj7 obj23)
   goals met: 3 of 9
48. (drive obj8 obj5 obj12)
   deleted: (at obj8 obj5)
   added: (at obj8 obj12)
   goals met: 3 of 9
49. (fly obj20 obj0 obj2)
   deleted: (at obj20 obj0)
   added: (at obj20 obj2)
   goals met: 3 of 9
50. (fly obj24 obj0 obj5)
   deleted: (at obj24 obj0)
   added: (at obj24 obj5)
   goals met: 3 of 9
51. (fly obj26 obj0 obj5)
   deleted: (at obj26 obj0)
   added: (at obj26 obj5)
   goals met: 3 of 9
52. (unload obj4 obj14 obj17)
   deleted: (in obj14 obj4)
   added: (at obj14 obj17)
   goals met: 4 of 9
53. (unload obj7 obj10 obj23)
   deleted: (in obj10 obj7)
   added: (at obj10 obj23)
   goals met: 5 of 9
54. (unload obj7 obj21 obj23)
   deleted: (in obj21 obj7)
   added: (at obj21 obj23)
   goals met: 6 of 9
55. (unload obj8 obj19 obj12)
   deleted: (in obj19 obj8)
   added: (at obj19 obj12)
   goals met: 7 of 9
56. (unload obj8 obj27 obj12)
   deleted: (in obj27 obj8)
   added: (at obj27 obj12)
   goals met: 8 of 9
57. (unload obj8 obj9 obj12)
   deleted: (in obj9 obj8)
   added: (at obj9 obj12)
   goals met: 9 of 9
